HA/Catalogs/ПрикрепленныеФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПрикрепленныеФайлы</Name>
			<Comment>Хранилище информации о прикрепленном к объекту БД файле</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДанныеФайла</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОткрытияФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОткрытияПрикрепленногоФайла</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширениеФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходноеИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСинхронизировать</Name>
					<Comment>Исключить из синхронизации с мобильным приложением</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСохранения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HA/Catalogs/ПрикрепленныеФайлы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
//Справочник.ПрикрепленныеФайлы.ФормаЭлемента
//  
//Параметры формы:
//  Стандартные параметры формы
//  
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	АктуализироватьНабор();
	
	СсылкаНаДанные = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ДанныеФайла");
	ОбновитьПредставлениеДанных();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если НаборВладельцев.Количество() = 0 Тогда
		АктуализироватьНабор();
	Иначе
		ЗаписатьНабор();
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы


#КонецОбласти


#Область ОбработчикиНабораЗаписейРегистраСведений



#КонецОбласти 


#Область ОбработчикиКомандФормы



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПредставлениеДанных()

	Если Объект.СпособОткрытияФайла = Перечисления.СпособОткрытияПрикрепленногоФайла.КакИзображение
		Или Объект.СпособОткрытияФайла = Перечисления.СпособОткрытияПрикрепленногоФайла.КакВидеоЗапись Тогда
		СсылкаНаПредставлениеДанных = СсылкаНаДанные;
	ИначеЕсли Объект.СпособОткрытияФайла = Перечисления.СпособОткрытияПрикрепленногоФайла.КакАудиоФайл Тогда
		СсылкаНаПредставлениеДанных = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.Аудиофайл.ПолучитьДвоичныеДанные(), УникальныйИдентификатор);
	Иначе
		СсылкаНаПредставлениеДанных = "";
	КонецЕсли;
	
	ИнформацияОФайле = НСтр("ru='Изменен: %1, размер: %2'");
	ИнформацияОФайле = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ИнформацияОФайле, 
					Формат(Объект.ДатаСоздания, "Л=ru_RU; ДЛФ=DT"), Формат(Объект.РазмерФайла/1024, "ЧДЦ=") + " kb.");
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Если Форма.Объект.Ссылка.Пустая() Тогда
		Форма.Элементы.ГруппаСтраницыФормы.ТекущаяСтраница = Форма.Элементы.СтраницаОсновное;
		Форма.Элементы.СтраницаВладельцы.Доступность = Ложь;
	Иначе
		Форма.Элементы.СтраницаВладельцы.Доступность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура АктуализироватьНабор()

	НаборВладельцев.Очистить();
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.ПринадлежностьФайлов.СоздатьНаборЗаписей();
	Набор.Отбор.ПрикрепленныйФайл.Установить(Объект.Ссылка);
	Набор.Прочитать();
	
	НаборВладельцев.Загрузить(Набор.Выгрузить());

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНабор()

	Набор = РегистрыСведений.ПринадлежностьФайлов.СоздатьНаборЗаписей();
	Набор.Отбор.ПрикрепленныйФайл.Установить(Объект.Ссылка);
	
	ТаблицаВладельцев = НаборВладельцев.Выгрузить();
	ТаблицаВладельцев.Свернуть("ВладелецФайла");
	
	Для каждого Строка Из ТаблицаВладельцев Цикл
		
		Запись = Набор.Добавить();
		Запись.ВладелецФайла = Строка.ВладелецФайла;
		Запись.ПрикрепленныйФайл = Объект.Ссылка;
		
	КонецЦикла;
	
	Набор.Записать(Истина);

КонецПроцедуры

#КонецОбласти
